Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pio.h
/* -------- PIO_WPSR : (PIO Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define PIO_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (PIO_WPSR) Write Protection Violation Status Position */
#define PIO_WPSR_WPVS_Msk                     (_UINT32_(0x1) << PIO_WPSR_WPVS_Pos)                 /* (PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_WPSR_WPVS(value)                  (PIO_WPSR_WPVS_Msk & (_UINT32_(value) << PIO_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the PIO_WPSR register */
#define PIO_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (PIO_WPSR) Write Protection Violation Source Position */
#define PIO_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << PIO_WPSR_WPVSRC_Pos)            /* (PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_WPSR_WPVSRC(value)                (PIO_WPSR_WPVSRC_Msk & (_UINT32_(value) << PIO_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the PIO_WPSR register */
#define PIO_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (PIO_WPSR) Register Mask  */


/* -------- PIO_SCHMITT : (PIO Offset: 0x100) (R/W 32) Schmitt Trigger Register -------- */
#define PIO_SCHMITT_SCHMITT0_Pos              _UINT32_(0)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT0_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT0_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT0(value)           (PIO_SCHMITT_SCHMITT0_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT0_Pos)) /* Assigment of value for SCHMITT0 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT1_Pos              _UINT32_(1)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT1_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT1_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT1(value)           (PIO_SCHMITT_SCHMITT1_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT1_Pos)) /* Assigment of value for SCHMITT1 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT2_Pos              _UINT32_(2)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT2_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT2_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT2(value)           (PIO_SCHMITT_SCHMITT2_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT2_Pos)) /* Assigment of value for SCHMITT2 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT3_Pos              _UINT32_(3)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT3_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT3_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT3(value)           (PIO_SCHMITT_SCHMITT3_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT3_Pos)) /* Assigment of value for SCHMITT3 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT4_Pos              _UINT32_(4)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT4_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT4_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT4(value)           (PIO_SCHMITT_SCHMITT4_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT4_Pos)) /* Assigment of value for SCHMITT4 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT5_Pos              _UINT32_(5)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT5_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT5_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT5(value)           (PIO_SCHMITT_SCHMITT5_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT5_Pos)) /* Assigment of value for SCHMITT5 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT6_Pos              _UINT32_(6)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT6_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT6_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT6(value)           (PIO_SCHMITT_SCHMITT6_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT6_Pos)) /* Assigment of value for SCHMITT6 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT7_Pos              _UINT32_(7)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT7_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT7_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT7(value)           (PIO_SCHMITT_SCHMITT7_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT7_Pos)) /* Assigment of value for SCHMITT7 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT8_Pos              _UINT32_(8)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT8_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT8_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT8(value)           (PIO_SCHMITT_SCHMITT8_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT8_Pos)) /* Assigment of value for SCHMITT8 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT9_Pos              _UINT32_(9)                                          /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT9_Msk              (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT9_Pos)          /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT9(value)           (PIO_SCHMITT_SCHMITT9_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT9_Pos)) /* Assigment of value for SCHMITT9 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT10_Pos             _UINT32_(10)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT10_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT10_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT10(value)          (PIO_SCHMITT_SCHMITT10_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT10_Pos)) /* Assigment of value for SCHMITT10 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT11_Pos             _UINT32_(11)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT11_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT11_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT11(value)          (PIO_SCHMITT_SCHMITT11_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT11_Pos)) /* Assigment of value for SCHMITT11 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT12_Pos             _UINT32_(12)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT12_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT12_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT12(value)          (PIO_SCHMITT_SCHMITT12_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT12_Pos)) /* Assigment of value for SCHMITT12 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT13_Pos             _UINT32_(13)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT13_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT13_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT13(value)          (PIO_SCHMITT_SCHMITT13_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT13_Pos)) /* Assigment of value for SCHMITT13 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT14_Pos             _UINT32_(14)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT14_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT14_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT14(value)          (PIO_SCHMITT_SCHMITT14_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT14_Pos)) /* Assigment of value for SCHMITT14 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT15_Pos             _UINT32_(15)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT15_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT15_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT15(value)          (PIO_SCHMITT_SCHMITT15_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT15_Pos)) /* Assigment of value for SCHMITT15 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT16_Pos             _UINT32_(16)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT16_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT16_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT16(value)          (PIO_SCHMITT_SCHMITT16_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT16_Pos)) /* Assigment of value for SCHMITT16 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT17_Pos             _UINT32_(17)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT17_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT17_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT17(value)          (PIO_SCHMITT_SCHMITT17_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT17_Pos)) /* Assigment of value for SCHMITT17 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT18_Pos             _UINT32_(18)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT18_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT18_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT18(value)          (PIO_SCHMITT_SCHMITT18_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT18_Pos)) /* Assigment of value for SCHMITT18 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT19_Pos             _UINT32_(19)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT19_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT19_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT19(value)          (PIO_SCHMITT_SCHMITT19_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT19_Pos)) /* Assigment of value for SCHMITT19 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT20_Pos             _UINT32_(20)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT20_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT20_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT20(value)          (PIO_SCHMITT_SCHMITT20_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT20_Pos)) /* Assigment of value for SCHMITT20 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT21_Pos             _UINT32_(21)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT21_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT21_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT21(value)          (PIO_SCHMITT_SCHMITT21_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT21_Pos)) /* Assigment of value for SCHMITT21 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT22_Pos             _UINT32_(22)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT22_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT22_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT22(value)          (PIO_SCHMITT_SCHMITT22_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT22_Pos)) /* Assigment of value for SCHMITT22 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT23_Pos             _UINT32_(23)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT23_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT23_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT23(value)          (PIO_SCHMITT_SCHMITT23_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT23_Pos)) /* Assigment of value for SCHMITT23 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT24_Pos             _UINT32_(24)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT24_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT24_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT24(value)          (PIO_SCHMITT_SCHMITT24_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT24_Pos)) /* Assigment of value for SCHMITT24 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT25_Pos             _UINT32_(25)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT25_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT25_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT25(value)          (PIO_SCHMITT_SCHMITT25_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT25_Pos)) /* Assigment of value for SCHMITT25 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT26_Pos             _UINT32_(26)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT26_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT26_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT26(value)          (PIO_SCHMITT_SCHMITT26_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT26_Pos)) /* Assigment of value for SCHMITT26 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT27_Pos             _UINT32_(27)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT27_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT27_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT27(value)          (PIO_SCHMITT_SCHMITT27_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT27_Pos)) /* Assigment of value for SCHMITT27 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT28_Pos             _UINT32_(28)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT28_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT28_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT28(value)          (PIO_SCHMITT_SCHMITT28_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT28_Pos)) /* Assigment of value for SCHMITT28 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT29_Pos             _UINT32_(29)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT29_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT29_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT29(value)          (PIO_SCHMITT_SCHMITT29_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT29_Pos)) /* Assigment of value for SCHMITT29 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT30_Pos             _UINT32_(30)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT30_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT30_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT30(value)          (PIO_SCHMITT_SCHMITT30_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT30_Pos)) /* Assigment of value for SCHMITT30 in the PIO_SCHMITT register */
#define PIO_SCHMITT_SCHMITT31_Pos             _UINT32_(31)                                         /* (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT31_Msk             (_UINT32_(0x1) << PIO_SCHMITT_SCHMITT31_Pos)         /* (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT31(value)          (PIO_SCHMITT_SCHMITT31_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT31_Pos)) /* Assigment of value for SCHMITT31 in the PIO_SCHMITT register */
#define PIO_SCHMITT_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PIO_SCHMITT) Register Mask  */

#define PIO_SCHMITT_SCHMITT_Pos               _UINT32_(0)                                          /* (PIO_SCHMITT Position) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT_Msk               (_UINT32_(0xFFFFFFFF) << PIO_SCHMITT_SCHMITT_Pos)    /* (PIO_SCHMITT Mask) SCHMITT */
#define PIO_SCHMITT_SCHMITT(value)            (PIO_SCHMITT_SCHMITT_Msk & (_UINT32_(value) << PIO_SCHMITT_SCHMITT_Pos)) 

