Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pio.h
/* -------- PIO_DRIVER : (PIO Offset: 0x118) (R/W 32) I/O Drive Register -------- */
#define PIO_DRIVER_LINE0_Pos                  _UINT32_(0)                                          /* (PIO_DRIVER) Drive of PIO Line 0 Position */
#define PIO_DRIVER_LINE0_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE0_Pos)              /* (PIO_DRIVER) Drive of PIO Line 0 Mask */
#define PIO_DRIVER_LINE0(value)               (PIO_DRIVER_LINE0_Msk & (_UINT32_(value) << PIO_DRIVER_LINE0_Pos)) /* Assigment of value for LINE0 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE0_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE0_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE0_LOW_DRIVE            (PIO_DRIVER_LINE0_LOW_DRIVE_Val << PIO_DRIVER_LINE0_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE0_HIGH_DRIVE           (PIO_DRIVER_LINE0_HIGH_DRIVE_Val << PIO_DRIVER_LINE0_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE1_Pos                  _UINT32_(1)                                          /* (PIO_DRIVER) Drive of PIO Line 1 Position */
#define PIO_DRIVER_LINE1_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE1_Pos)              /* (PIO_DRIVER) Drive of PIO Line 1 Mask */
#define PIO_DRIVER_LINE1(value)               (PIO_DRIVER_LINE1_Msk & (_UINT32_(value) << PIO_DRIVER_LINE1_Pos)) /* Assigment of value for LINE1 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE1_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE1_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE1_LOW_DRIVE            (PIO_DRIVER_LINE1_LOW_DRIVE_Val << PIO_DRIVER_LINE1_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE1_HIGH_DRIVE           (PIO_DRIVER_LINE1_HIGH_DRIVE_Val << PIO_DRIVER_LINE1_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE2_Pos                  _UINT32_(2)                                          /* (PIO_DRIVER) Drive of PIO Line 2 Position */
#define PIO_DRIVER_LINE2_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE2_Pos)              /* (PIO_DRIVER) Drive of PIO Line 2 Mask */
#define PIO_DRIVER_LINE2(value)               (PIO_DRIVER_LINE2_Msk & (_UINT32_(value) << PIO_DRIVER_LINE2_Pos)) /* Assigment of value for LINE2 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE2_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE2_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE2_LOW_DRIVE            (PIO_DRIVER_LINE2_LOW_DRIVE_Val << PIO_DRIVER_LINE2_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE2_HIGH_DRIVE           (PIO_DRIVER_LINE2_HIGH_DRIVE_Val << PIO_DRIVER_LINE2_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE3_Pos                  _UINT32_(3)                                          /* (PIO_DRIVER) Drive of PIO Line 3 Position */
#define PIO_DRIVER_LINE3_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE3_Pos)              /* (PIO_DRIVER) Drive of PIO Line 3 Mask */
#define PIO_DRIVER_LINE3(value)               (PIO_DRIVER_LINE3_Msk & (_UINT32_(value) << PIO_DRIVER_LINE3_Pos)) /* Assigment of value for LINE3 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE3_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE3_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE3_LOW_DRIVE            (PIO_DRIVER_LINE3_LOW_DRIVE_Val << PIO_DRIVER_LINE3_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE3_HIGH_DRIVE           (PIO_DRIVER_LINE3_HIGH_DRIVE_Val << PIO_DRIVER_LINE3_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE4_Pos                  _UINT32_(4)                                          /* (PIO_DRIVER) Drive of PIO Line 4 Position */
#define PIO_DRIVER_LINE4_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE4_Pos)              /* (PIO_DRIVER) Drive of PIO Line 4 Mask */
#define PIO_DRIVER_LINE4(value)               (PIO_DRIVER_LINE4_Msk & (_UINT32_(value) << PIO_DRIVER_LINE4_Pos)) /* Assigment of value for LINE4 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE4_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE4_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE4_LOW_DRIVE            (PIO_DRIVER_LINE4_LOW_DRIVE_Val << PIO_DRIVER_LINE4_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE4_HIGH_DRIVE           (PIO_DRIVER_LINE4_HIGH_DRIVE_Val << PIO_DRIVER_LINE4_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE5_Pos                  _UINT32_(5)                                          /* (PIO_DRIVER) Drive of PIO Line 5 Position */
#define PIO_DRIVER_LINE5_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE5_Pos)              /* (PIO_DRIVER) Drive of PIO Line 5 Mask */
#define PIO_DRIVER_LINE5(value)               (PIO_DRIVER_LINE5_Msk & (_UINT32_(value) << PIO_DRIVER_LINE5_Pos)) /* Assigment of value for LINE5 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE5_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE5_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE5_LOW_DRIVE            (PIO_DRIVER_LINE5_LOW_DRIVE_Val << PIO_DRIVER_LINE5_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE5_HIGH_DRIVE           (PIO_DRIVER_LINE5_HIGH_DRIVE_Val << PIO_DRIVER_LINE5_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE6_Pos                  _UINT32_(6)                                          /* (PIO_DRIVER) Drive of PIO Line 6 Position */
#define PIO_DRIVER_LINE6_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE6_Pos)              /* (PIO_DRIVER) Drive of PIO Line 6 Mask */
#define PIO_DRIVER_LINE6(value)               (PIO_DRIVER_LINE6_Msk & (_UINT32_(value) << PIO_DRIVER_LINE6_Pos)) /* Assigment of value for LINE6 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE6_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE6_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE6_LOW_DRIVE            (PIO_DRIVER_LINE6_LOW_DRIVE_Val << PIO_DRIVER_LINE6_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE6_HIGH_DRIVE           (PIO_DRIVER_LINE6_HIGH_DRIVE_Val << PIO_DRIVER_LINE6_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE7_Pos                  _UINT32_(7)                                          /* (PIO_DRIVER) Drive of PIO Line 7 Position */
#define PIO_DRIVER_LINE7_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE7_Pos)              /* (PIO_DRIVER) Drive of PIO Line 7 Mask */
#define PIO_DRIVER_LINE7(value)               (PIO_DRIVER_LINE7_Msk & (_UINT32_(value) << PIO_DRIVER_LINE7_Pos)) /* Assigment of value for LINE7 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE7_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE7_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE7_LOW_DRIVE            (PIO_DRIVER_LINE7_LOW_DRIVE_Val << PIO_DRIVER_LINE7_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE7_HIGH_DRIVE           (PIO_DRIVER_LINE7_HIGH_DRIVE_Val << PIO_DRIVER_LINE7_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE8_Pos                  _UINT32_(8)                                          /* (PIO_DRIVER) Drive of PIO Line 8 Position */
#define PIO_DRIVER_LINE8_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE8_Pos)              /* (PIO_DRIVER) Drive of PIO Line 8 Mask */
#define PIO_DRIVER_LINE8(value)               (PIO_DRIVER_LINE8_Msk & (_UINT32_(value) << PIO_DRIVER_LINE8_Pos)) /* Assigment of value for LINE8 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE8_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE8_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE8_LOW_DRIVE            (PIO_DRIVER_LINE8_LOW_DRIVE_Val << PIO_DRIVER_LINE8_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE8_HIGH_DRIVE           (PIO_DRIVER_LINE8_HIGH_DRIVE_Val << PIO_DRIVER_LINE8_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE9_Pos                  _UINT32_(9)                                          /* (PIO_DRIVER) Drive of PIO Line 9 Position */
#define PIO_DRIVER_LINE9_Msk                  (_UINT32_(0x1) << PIO_DRIVER_LINE9_Pos)              /* (PIO_DRIVER) Drive of PIO Line 9 Mask */
#define PIO_DRIVER_LINE9(value)               (PIO_DRIVER_LINE9_Msk & (_UINT32_(value) << PIO_DRIVER_LINE9_Pos)) /* Assigment of value for LINE9 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE9_LOW_DRIVE_Val      _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE9_HIGH_DRIVE_Val     _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE9_LOW_DRIVE            (PIO_DRIVER_LINE9_LOW_DRIVE_Val << PIO_DRIVER_LINE9_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE9_HIGH_DRIVE           (PIO_DRIVER_LINE9_HIGH_DRIVE_Val << PIO_DRIVER_LINE9_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE10_Pos                 _UINT32_(10)                                         /* (PIO_DRIVER) Drive of PIO Line 10 Position */
#define PIO_DRIVER_LINE10_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE10_Pos)             /* (PIO_DRIVER) Drive of PIO Line 10 Mask */
#define PIO_DRIVER_LINE10(value)              (PIO_DRIVER_LINE10_Msk & (_UINT32_(value) << PIO_DRIVER_LINE10_Pos)) /* Assigment of value for LINE10 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE10_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE10_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE10_LOW_DRIVE           (PIO_DRIVER_LINE10_LOW_DRIVE_Val << PIO_DRIVER_LINE10_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE10_HIGH_DRIVE          (PIO_DRIVER_LINE10_HIGH_DRIVE_Val << PIO_DRIVER_LINE10_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE11_Pos                 _UINT32_(11)                                         /* (PIO_DRIVER) Drive of PIO Line 11 Position */
#define PIO_DRIVER_LINE11_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE11_Pos)             /* (PIO_DRIVER) Drive of PIO Line 11 Mask */
#define PIO_DRIVER_LINE11(value)              (PIO_DRIVER_LINE11_Msk & (_UINT32_(value) << PIO_DRIVER_LINE11_Pos)) /* Assigment of value for LINE11 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE11_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE11_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE11_LOW_DRIVE           (PIO_DRIVER_LINE11_LOW_DRIVE_Val << PIO_DRIVER_LINE11_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE11_HIGH_DRIVE          (PIO_DRIVER_LINE11_HIGH_DRIVE_Val << PIO_DRIVER_LINE11_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE12_Pos                 _UINT32_(12)                                         /* (PIO_DRIVER) Drive of PIO Line 12 Position */
#define PIO_DRIVER_LINE12_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE12_Pos)             /* (PIO_DRIVER) Drive of PIO Line 12 Mask */
#define PIO_DRIVER_LINE12(value)              (PIO_DRIVER_LINE12_Msk & (_UINT32_(value) << PIO_DRIVER_LINE12_Pos)) /* Assigment of value for LINE12 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE12_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE12_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE12_LOW_DRIVE           (PIO_DRIVER_LINE12_LOW_DRIVE_Val << PIO_DRIVER_LINE12_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE12_HIGH_DRIVE          (PIO_DRIVER_LINE12_HIGH_DRIVE_Val << PIO_DRIVER_LINE12_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE13_Pos                 _UINT32_(13)                                         /* (PIO_DRIVER) Drive of PIO Line 13 Position */
#define PIO_DRIVER_LINE13_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE13_Pos)             /* (PIO_DRIVER) Drive of PIO Line 13 Mask */
#define PIO_DRIVER_LINE13(value)              (PIO_DRIVER_LINE13_Msk & (_UINT32_(value) << PIO_DRIVER_LINE13_Pos)) /* Assigment of value for LINE13 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE13_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE13_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE13_LOW_DRIVE           (PIO_DRIVER_LINE13_LOW_DRIVE_Val << PIO_DRIVER_LINE13_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE13_HIGH_DRIVE          (PIO_DRIVER_LINE13_HIGH_DRIVE_Val << PIO_DRIVER_LINE13_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE14_Pos                 _UINT32_(14)                                         /* (PIO_DRIVER) Drive of PIO Line 14 Position */
#define PIO_DRIVER_LINE14_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE14_Pos)             /* (PIO_DRIVER) Drive of PIO Line 14 Mask */
#define PIO_DRIVER_LINE14(value)              (PIO_DRIVER_LINE14_Msk & (_UINT32_(value) << PIO_DRIVER_LINE14_Pos)) /* Assigment of value for LINE14 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE14_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE14_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE14_LOW_DRIVE           (PIO_DRIVER_LINE14_LOW_DRIVE_Val << PIO_DRIVER_LINE14_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE14_HIGH_DRIVE          (PIO_DRIVER_LINE14_HIGH_DRIVE_Val << PIO_DRIVER_LINE14_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE15_Pos                 _UINT32_(15)                                         /* (PIO_DRIVER) Drive of PIO Line 15 Position */
#define PIO_DRIVER_LINE15_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE15_Pos)             /* (PIO_DRIVER) Drive of PIO Line 15 Mask */
#define PIO_DRIVER_LINE15(value)              (PIO_DRIVER_LINE15_Msk & (_UINT32_(value) << PIO_DRIVER_LINE15_Pos)) /* Assigment of value for LINE15 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE15_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE15_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE15_LOW_DRIVE           (PIO_DRIVER_LINE15_LOW_DRIVE_Val << PIO_DRIVER_LINE15_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE15_HIGH_DRIVE          (PIO_DRIVER_LINE15_HIGH_DRIVE_Val << PIO_DRIVER_LINE15_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE16_Pos                 _UINT32_(16)                                         /* (PIO_DRIVER) Drive of PIO Line 16 Position */
#define PIO_DRIVER_LINE16_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE16_Pos)             /* (PIO_DRIVER) Drive of PIO Line 16 Mask */
#define PIO_DRIVER_LINE16(value)              (PIO_DRIVER_LINE16_Msk & (_UINT32_(value) << PIO_DRIVER_LINE16_Pos)) /* Assigment of value for LINE16 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE16_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE16_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE16_LOW_DRIVE           (PIO_DRIVER_LINE16_LOW_DRIVE_Val << PIO_DRIVER_LINE16_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE16_HIGH_DRIVE          (PIO_DRIVER_LINE16_HIGH_DRIVE_Val << PIO_DRIVER_LINE16_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE17_Pos                 _UINT32_(17)                                         /* (PIO_DRIVER) Drive of PIO Line 17 Position */
#define PIO_DRIVER_LINE17_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE17_Pos)             /* (PIO_DRIVER) Drive of PIO Line 17 Mask */
#define PIO_DRIVER_LINE17(value)              (PIO_DRIVER_LINE17_Msk & (_UINT32_(value) << PIO_DRIVER_LINE17_Pos)) /* Assigment of value for LINE17 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE17_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE17_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE17_LOW_DRIVE           (PIO_DRIVER_LINE17_LOW_DRIVE_Val << PIO_DRIVER_LINE17_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE17_HIGH_DRIVE          (PIO_DRIVER_LINE17_HIGH_DRIVE_Val << PIO_DRIVER_LINE17_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE18_Pos                 _UINT32_(18)                                         /* (PIO_DRIVER) Drive of PIO Line 18 Position */
#define PIO_DRIVER_LINE18_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE18_Pos)             /* (PIO_DRIVER) Drive of PIO Line 18 Mask */
#define PIO_DRIVER_LINE18(value)              (PIO_DRIVER_LINE18_Msk & (_UINT32_(value) << PIO_DRIVER_LINE18_Pos)) /* Assigment of value for LINE18 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE18_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE18_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE18_LOW_DRIVE           (PIO_DRIVER_LINE18_LOW_DRIVE_Val << PIO_DRIVER_LINE18_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE18_HIGH_DRIVE          (PIO_DRIVER_LINE18_HIGH_DRIVE_Val << PIO_DRIVER_LINE18_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE19_Pos                 _UINT32_(19)                                         /* (PIO_DRIVER) Drive of PIO Line 19 Position */
#define PIO_DRIVER_LINE19_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE19_Pos)             /* (PIO_DRIVER) Drive of PIO Line 19 Mask */
#define PIO_DRIVER_LINE19(value)              (PIO_DRIVER_LINE19_Msk & (_UINT32_(value) << PIO_DRIVER_LINE19_Pos)) /* Assigment of value for LINE19 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE19_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE19_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE19_LOW_DRIVE           (PIO_DRIVER_LINE19_LOW_DRIVE_Val << PIO_DRIVER_LINE19_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE19_HIGH_DRIVE          (PIO_DRIVER_LINE19_HIGH_DRIVE_Val << PIO_DRIVER_LINE19_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE20_Pos                 _UINT32_(20)                                         /* (PIO_DRIVER) Drive of PIO Line 20 Position */
#define PIO_DRIVER_LINE20_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE20_Pos)             /* (PIO_DRIVER) Drive of PIO Line 20 Mask */
#define PIO_DRIVER_LINE20(value)              (PIO_DRIVER_LINE20_Msk & (_UINT32_(value) << PIO_DRIVER_LINE20_Pos)) /* Assigment of value for LINE20 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE20_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE20_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE20_LOW_DRIVE           (PIO_DRIVER_LINE20_LOW_DRIVE_Val << PIO_DRIVER_LINE20_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE20_HIGH_DRIVE          (PIO_DRIVER_LINE20_HIGH_DRIVE_Val << PIO_DRIVER_LINE20_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE21_Pos                 _UINT32_(21)                                         /* (PIO_DRIVER) Drive of PIO Line 21 Position */
#define PIO_DRIVER_LINE21_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE21_Pos)             /* (PIO_DRIVER) Drive of PIO Line 21 Mask */
#define PIO_DRIVER_LINE21(value)              (PIO_DRIVER_LINE21_Msk & (_UINT32_(value) << PIO_DRIVER_LINE21_Pos)) /* Assigment of value for LINE21 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE21_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE21_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE21_LOW_DRIVE           (PIO_DRIVER_LINE21_LOW_DRIVE_Val << PIO_DRIVER_LINE21_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE21_HIGH_DRIVE          (PIO_DRIVER_LINE21_HIGH_DRIVE_Val << PIO_DRIVER_LINE21_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE22_Pos                 _UINT32_(22)                                         /* (PIO_DRIVER) Drive of PIO Line 22 Position */
#define PIO_DRIVER_LINE22_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE22_Pos)             /* (PIO_DRIVER) Drive of PIO Line 22 Mask */
#define PIO_DRIVER_LINE22(value)              (PIO_DRIVER_LINE22_Msk & (_UINT32_(value) << PIO_DRIVER_LINE22_Pos)) /* Assigment of value for LINE22 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE22_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE22_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE22_LOW_DRIVE           (PIO_DRIVER_LINE22_LOW_DRIVE_Val << PIO_DRIVER_LINE22_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE22_HIGH_DRIVE          (PIO_DRIVER_LINE22_HIGH_DRIVE_Val << PIO_DRIVER_LINE22_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE23_Pos                 _UINT32_(23)                                         /* (PIO_DRIVER) Drive of PIO Line 23 Position */
#define PIO_DRIVER_LINE23_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE23_Pos)             /* (PIO_DRIVER) Drive of PIO Line 23 Mask */
