Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pio.h
#define PIO_DRIVER_LINE23(value)              (PIO_DRIVER_LINE23_Msk & (_UINT32_(value) << PIO_DRIVER_LINE23_Pos)) /* Assigment of value for LINE23 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE23_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE23_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE23_LOW_DRIVE           (PIO_DRIVER_LINE23_LOW_DRIVE_Val << PIO_DRIVER_LINE23_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE23_HIGH_DRIVE          (PIO_DRIVER_LINE23_HIGH_DRIVE_Val << PIO_DRIVER_LINE23_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE24_Pos                 _UINT32_(24)                                         /* (PIO_DRIVER) Drive of PIO Line 24 Position */
#define PIO_DRIVER_LINE24_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE24_Pos)             /* (PIO_DRIVER) Drive of PIO Line 24 Mask */
#define PIO_DRIVER_LINE24(value)              (PIO_DRIVER_LINE24_Msk & (_UINT32_(value) << PIO_DRIVER_LINE24_Pos)) /* Assigment of value for LINE24 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE24_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE24_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE24_LOW_DRIVE           (PIO_DRIVER_LINE24_LOW_DRIVE_Val << PIO_DRIVER_LINE24_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE24_HIGH_DRIVE          (PIO_DRIVER_LINE24_HIGH_DRIVE_Val << PIO_DRIVER_LINE24_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE25_Pos                 _UINT32_(25)                                         /* (PIO_DRIVER) Drive of PIO Line 25 Position */
#define PIO_DRIVER_LINE25_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE25_Pos)             /* (PIO_DRIVER) Drive of PIO Line 25 Mask */
#define PIO_DRIVER_LINE25(value)              (PIO_DRIVER_LINE25_Msk & (_UINT32_(value) << PIO_DRIVER_LINE25_Pos)) /* Assigment of value for LINE25 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE25_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE25_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE25_LOW_DRIVE           (PIO_DRIVER_LINE25_LOW_DRIVE_Val << PIO_DRIVER_LINE25_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE25_HIGH_DRIVE          (PIO_DRIVER_LINE25_HIGH_DRIVE_Val << PIO_DRIVER_LINE25_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE26_Pos                 _UINT32_(26)                                         /* (PIO_DRIVER) Drive of PIO Line 26 Position */
#define PIO_DRIVER_LINE26_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE26_Pos)             /* (PIO_DRIVER) Drive of PIO Line 26 Mask */
#define PIO_DRIVER_LINE26(value)              (PIO_DRIVER_LINE26_Msk & (_UINT32_(value) << PIO_DRIVER_LINE26_Pos)) /* Assigment of value for LINE26 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE26_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE26_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE26_LOW_DRIVE           (PIO_DRIVER_LINE26_LOW_DRIVE_Val << PIO_DRIVER_LINE26_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE26_HIGH_DRIVE          (PIO_DRIVER_LINE26_HIGH_DRIVE_Val << PIO_DRIVER_LINE26_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE27_Pos                 _UINT32_(27)                                         /* (PIO_DRIVER) Drive of PIO Line 27 Position */
#define PIO_DRIVER_LINE27_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE27_Pos)             /* (PIO_DRIVER) Drive of PIO Line 27 Mask */
#define PIO_DRIVER_LINE27(value)              (PIO_DRIVER_LINE27_Msk & (_UINT32_(value) << PIO_DRIVER_LINE27_Pos)) /* Assigment of value for LINE27 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE27_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE27_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE27_LOW_DRIVE           (PIO_DRIVER_LINE27_LOW_DRIVE_Val << PIO_DRIVER_LINE27_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE27_HIGH_DRIVE          (PIO_DRIVER_LINE27_HIGH_DRIVE_Val << PIO_DRIVER_LINE27_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE28_Pos                 _UINT32_(28)                                         /* (PIO_DRIVER) Drive of PIO Line 28 Position */
#define PIO_DRIVER_LINE28_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE28_Pos)             /* (PIO_DRIVER) Drive of PIO Line 28 Mask */
#define PIO_DRIVER_LINE28(value)              (PIO_DRIVER_LINE28_Msk & (_UINT32_(value) << PIO_DRIVER_LINE28_Pos)) /* Assigment of value for LINE28 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE28_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE28_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE28_LOW_DRIVE           (PIO_DRIVER_LINE28_LOW_DRIVE_Val << PIO_DRIVER_LINE28_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE28_HIGH_DRIVE          (PIO_DRIVER_LINE28_HIGH_DRIVE_Val << PIO_DRIVER_LINE28_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE29_Pos                 _UINT32_(29)                                         /* (PIO_DRIVER) Drive of PIO Line 29 Position */
#define PIO_DRIVER_LINE29_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE29_Pos)             /* (PIO_DRIVER) Drive of PIO Line 29 Mask */
#define PIO_DRIVER_LINE29(value)              (PIO_DRIVER_LINE29_Msk & (_UINT32_(value) << PIO_DRIVER_LINE29_Pos)) /* Assigment of value for LINE29 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE29_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE29_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE29_LOW_DRIVE           (PIO_DRIVER_LINE29_LOW_DRIVE_Val << PIO_DRIVER_LINE29_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE29_HIGH_DRIVE          (PIO_DRIVER_LINE29_HIGH_DRIVE_Val << PIO_DRIVER_LINE29_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE30_Pos                 _UINT32_(30)                                         /* (PIO_DRIVER) Drive of PIO Line 30 Position */
#define PIO_DRIVER_LINE30_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE30_Pos)             /* (PIO_DRIVER) Drive of PIO Line 30 Mask */
#define PIO_DRIVER_LINE30(value)              (PIO_DRIVER_LINE30_Msk & (_UINT32_(value) << PIO_DRIVER_LINE30_Pos)) /* Assigment of value for LINE30 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE30_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE30_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE30_LOW_DRIVE           (PIO_DRIVER_LINE30_LOW_DRIVE_Val << PIO_DRIVER_LINE30_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE30_HIGH_DRIVE          (PIO_DRIVER_LINE30_HIGH_DRIVE_Val << PIO_DRIVER_LINE30_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE31_Pos                 _UINT32_(31)                                         /* (PIO_DRIVER) Drive of PIO Line 31 Position */
#define PIO_DRIVER_LINE31_Msk                 (_UINT32_(0x1) << PIO_DRIVER_LINE31_Pos)             /* (PIO_DRIVER) Drive of PIO Line 31 Mask */
#define PIO_DRIVER_LINE31(value)              (PIO_DRIVER_LINE31_Msk & (_UINT32_(value) << PIO_DRIVER_LINE31_Pos)) /* Assigment of value for LINE31 in the PIO_DRIVER register */
#define   PIO_DRIVER_LINE31_LOW_DRIVE_Val     _UINT32_(0x0)                                        /* (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE31_HIGH_DRIVE_Val    _UINT32_(0x1)                                        /* (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE31_LOW_DRIVE           (PIO_DRIVER_LINE31_LOW_DRIVE_Val << PIO_DRIVER_LINE31_Pos) /* (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE31_HIGH_DRIVE          (PIO_DRIVER_LINE31_HIGH_DRIVE_Val << PIO_DRIVER_LINE31_Pos) /* (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (PIO_DRIVER) Register Mask  */

#define PIO_DRIVER_LINE_Pos                   _UINT32_(0)                                          /* (PIO_DRIVER Position) Drive of PIO Line 3x */
#define PIO_DRIVER_LINE_Msk                   (_UINT32_(0xFFFFFFFF) << PIO_DRIVER_LINE_Pos)        /* (PIO_DRIVER Mask) LINE */
#define PIO_DRIVER_LINE(value)                (PIO_DRIVER_LINE_Msk & (_UINT32_(value) << PIO_DRIVER_LINE_Pos)) 

