Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pio.h
/* -------- PIO_PCMR : (PIO Offset: 0x150) (R/W 32) Parallel Capture Mode Register -------- */
#define PIO_PCMR_PCEN_Pos                     _UINT32_(0)                                          /* (PIO_PCMR) Parallel Capture Mode Enable Position */
#define PIO_PCMR_PCEN_Msk                     (_UINT32_(0x1) << PIO_PCMR_PCEN_Pos)                 /* (PIO_PCMR) Parallel Capture Mode Enable Mask */
#define PIO_PCMR_PCEN(value)                  (PIO_PCMR_PCEN_Msk & (_UINT32_(value) << PIO_PCMR_PCEN_Pos)) /* Assigment of value for PCEN in the PIO_PCMR register */
#define PIO_PCMR_DSIZE_Pos                    _UINT32_(4)                                          /* (PIO_PCMR) Parallel Capture Mode Data Size Position */
#define PIO_PCMR_DSIZE_Msk                    (_UINT32_(0x3) << PIO_PCMR_DSIZE_Pos)                /* (PIO_PCMR) Parallel Capture Mode Data Size Mask */
#define PIO_PCMR_DSIZE(value)                 (PIO_PCMR_DSIZE_Msk & (_UINT32_(value) << PIO_PCMR_DSIZE_Pos)) /* Assigment of value for DSIZE in the PIO_PCMR register */
#define   PIO_PCMR_DSIZE_BYTE_Val             _UINT32_(0x0)                                        /* (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit)  */
#define   PIO_PCMR_DSIZE_HALFWORD_Val         _UINT32_(0x1)                                        /* (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit)  */
#define   PIO_PCMR_DSIZE_WORD_Val             _UINT32_(0x2)                                        /* (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit)  */
#define PIO_PCMR_DSIZE_BYTE                   (PIO_PCMR_DSIZE_BYTE_Val << PIO_PCMR_DSIZE_Pos)      /* (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit) Position  */
#define PIO_PCMR_DSIZE_HALFWORD               (PIO_PCMR_DSIZE_HALFWORD_Val << PIO_PCMR_DSIZE_Pos)  /* (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit) Position  */
#define PIO_PCMR_DSIZE_WORD                   (PIO_PCMR_DSIZE_WORD_Val << PIO_PCMR_DSIZE_Pos)      /* (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit) Position  */
#define PIO_PCMR_ALWYS_Pos                    _UINT32_(9)                                          /* (PIO_PCMR) Parallel Capture Mode Always Sampling Position */
#define PIO_PCMR_ALWYS_Msk                    (_UINT32_(0x1) << PIO_PCMR_ALWYS_Pos)                /* (PIO_PCMR) Parallel Capture Mode Always Sampling Mask */
#define PIO_PCMR_ALWYS(value)                 (PIO_PCMR_ALWYS_Msk & (_UINT32_(value) << PIO_PCMR_ALWYS_Pos)) /* Assigment of value for ALWYS in the PIO_PCMR register */
#define PIO_PCMR_HALFS_Pos                    _UINT32_(10)                                         /* (PIO_PCMR) Parallel Capture Mode Half Sampling Position */
#define PIO_PCMR_HALFS_Msk                    (_UINT32_(0x1) << PIO_PCMR_HALFS_Pos)                /* (PIO_PCMR) Parallel Capture Mode Half Sampling Mask */
#define PIO_PCMR_HALFS(value)                 (PIO_PCMR_HALFS_Msk & (_UINT32_(value) << PIO_PCMR_HALFS_Pos)) /* Assigment of value for HALFS in the PIO_PCMR register */
#define PIO_PCMR_FRSTS_Pos                    _UINT32_(11)                                         /* (PIO_PCMR) Parallel Capture Mode First Sample Position */
#define PIO_PCMR_FRSTS_Msk                    (_UINT32_(0x1) << PIO_PCMR_FRSTS_Pos)                /* (PIO_PCMR) Parallel Capture Mode First Sample Mask */
#define PIO_PCMR_FRSTS(value)                 (PIO_PCMR_FRSTS_Msk & (_UINT32_(value) << PIO_PCMR_FRSTS_Pos)) /* Assigment of value for FRSTS in the PIO_PCMR register */
#define PIO_PCMR_Msk                          _UINT32_(0x00000E31)                                 /* (PIO_PCMR) Register Mask  */


/* -------- PIO_PCIER : (PIO Offset: 0x154) ( /W 32) Parallel Capture Interrupt Enable Register -------- */
#define PIO_PCIER_DRDY_Pos                    _UINT32_(0)                                          /* (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Position */
#define PIO_PCIER_DRDY_Msk                    (_UINT32_(0x1) << PIO_PCIER_DRDY_Pos)                /* (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Mask */
#define PIO_PCIER_DRDY(value)                 (PIO_PCIER_DRDY_Msk & (_UINT32_(value) << PIO_PCIER_DRDY_Pos)) /* Assigment of value for DRDY in the PIO_PCIER register */
#define PIO_PCIER_OVRE_Pos                    _UINT32_(1)                                          /* (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Position */
#define PIO_PCIER_OVRE_Msk                    (_UINT32_(0x1) << PIO_PCIER_OVRE_Pos)                /* (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Mask */
#define PIO_PCIER_OVRE(value)                 (PIO_PCIER_OVRE_Msk & (_UINT32_(value) << PIO_PCIER_OVRE_Pos)) /* Assigment of value for OVRE in the PIO_PCIER register */
#define PIO_PCIER_ENDRX_Pos                   _UINT32_(2)                                          /* (PIO_PCIER) End of Reception Transfer Interrupt Enable Position */
#define PIO_PCIER_ENDRX_Msk                   (_UINT32_(0x1) << PIO_PCIER_ENDRX_Pos)               /* (PIO_PCIER) End of Reception Transfer Interrupt Enable Mask */
#define PIO_PCIER_ENDRX(value)                (PIO_PCIER_ENDRX_Msk & (_UINT32_(value) << PIO_PCIER_ENDRX_Pos)) /* Assigment of value for ENDRX in the PIO_PCIER register */
#define PIO_PCIER_RXBUFF_Pos                  _UINT32_(3)                                          /* (PIO_PCIER) Reception Buffer Full Interrupt Enable Position */
#define PIO_PCIER_RXBUFF_Msk                  (_UINT32_(0x1) << PIO_PCIER_RXBUFF_Pos)              /* (PIO_PCIER) Reception Buffer Full Interrupt Enable Mask */
#define PIO_PCIER_RXBUFF(value)               (PIO_PCIER_RXBUFF_Msk & (_UINT32_(value) << PIO_PCIER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the PIO_PCIER register */
#define PIO_PCIER_Msk                         _UINT32_(0x0000000F)                                 /* (PIO_PCIER) Register Mask  */


/* -------- PIO_PCIDR : (PIO Offset: 0x158) ( /W 32) Parallel Capture Interrupt Disable Register -------- */
#define PIO_PCIDR_DRDY_Pos                    _UINT32_(0)                                          /* (PIO_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable Position */
#define PIO_PCIDR_DRDY_Msk                    (_UINT32_(0x1) << PIO_PCIDR_DRDY_Pos)                /* (PIO_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable Mask */
#define PIO_PCIDR_DRDY(value)                 (PIO_PCIDR_DRDY_Msk & (_UINT32_(value) << PIO_PCIDR_DRDY_Pos)) /* Assigment of value for DRDY in the PIO_PCIDR register */
#define PIO_PCIDR_OVRE_Pos                    _UINT32_(1)                                          /* (PIO_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable Position */
#define PIO_PCIDR_OVRE_Msk                    (_UINT32_(0x1) << PIO_PCIDR_OVRE_Pos)                /* (PIO_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable Mask */
#define PIO_PCIDR_OVRE(value)                 (PIO_PCIDR_OVRE_Msk & (_UINT32_(value) << PIO_PCIDR_OVRE_Pos)) /* Assigment of value for OVRE in the PIO_PCIDR register */
#define PIO_PCIDR_ENDRX_Pos                   _UINT32_(2)                                          /* (PIO_PCIDR) End of Reception Transfer Interrupt Disable Position */
#define PIO_PCIDR_ENDRX_Msk                   (_UINT32_(0x1) << PIO_PCIDR_ENDRX_Pos)               /* (PIO_PCIDR) End of Reception Transfer Interrupt Disable Mask */
#define PIO_PCIDR_ENDRX(value)                (PIO_PCIDR_ENDRX_Msk & (_UINT32_(value) << PIO_PCIDR_ENDRX_Pos)) /* Assigment of value for ENDRX in the PIO_PCIDR register */
#define PIO_PCIDR_RXBUFF_Pos                  _UINT32_(3)                                          /* (PIO_PCIDR) Reception Buffer Full Interrupt Disable Position */
#define PIO_PCIDR_RXBUFF_Msk                  (_UINT32_(0x1) << PIO_PCIDR_RXBUFF_Pos)              /* (PIO_PCIDR) Reception Buffer Full Interrupt Disable Mask */
#define PIO_PCIDR_RXBUFF(value)               (PIO_PCIDR_RXBUFF_Msk & (_UINT32_(value) << PIO_PCIDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the PIO_PCIDR register */
#define PIO_PCIDR_Msk                         _UINT32_(0x0000000F)                                 /* (PIO_PCIDR) Register Mask  */


/* -------- PIO_PCIMR : (PIO Offset: 0x15C) ( R/ 32) Parallel Capture Interrupt Mask Register -------- */
#define PIO_PCIMR_DRDY_Pos                    _UINT32_(0)                                          /* (PIO_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask Position */
#define PIO_PCIMR_DRDY_Msk                    (_UINT32_(0x1) << PIO_PCIMR_DRDY_Pos)                /* (PIO_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask Mask */
#define PIO_PCIMR_DRDY(value)                 (PIO_PCIMR_DRDY_Msk & (_UINT32_(value) << PIO_PCIMR_DRDY_Pos)) /* Assigment of value for DRDY in the PIO_PCIMR register */
#define PIO_PCIMR_OVRE_Pos                    _UINT32_(1)                                          /* (PIO_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask Position */
#define PIO_PCIMR_OVRE_Msk                    (_UINT32_(0x1) << PIO_PCIMR_OVRE_Pos)                /* (PIO_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask Mask */
#define PIO_PCIMR_OVRE(value)                 (PIO_PCIMR_OVRE_Msk & (_UINT32_(value) << PIO_PCIMR_OVRE_Pos)) /* Assigment of value for OVRE in the PIO_PCIMR register */
#define PIO_PCIMR_ENDRX_Pos                   _UINT32_(2)                                          /* (PIO_PCIMR) End of Reception Transfer Interrupt Mask Position */
#define PIO_PCIMR_ENDRX_Msk                   (_UINT32_(0x1) << PIO_PCIMR_ENDRX_Pos)               /* (PIO_PCIMR) End of Reception Transfer Interrupt Mask Mask */
#define PIO_PCIMR_ENDRX(value)                (PIO_PCIMR_ENDRX_Msk & (_UINT32_(value) << PIO_PCIMR_ENDRX_Pos)) /* Assigment of value for ENDRX in the PIO_PCIMR register */
#define PIO_PCIMR_RXBUFF_Pos                  _UINT32_(3)                                          /* (PIO_PCIMR) Reception Buffer Full Interrupt Mask Position */
#define PIO_PCIMR_RXBUFF_Msk                  (_UINT32_(0x1) << PIO_PCIMR_RXBUFF_Pos)              /* (PIO_PCIMR) Reception Buffer Full Interrupt Mask Mask */
#define PIO_PCIMR_RXBUFF(value)               (PIO_PCIMR_RXBUFF_Msk & (_UINT32_(value) << PIO_PCIMR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the PIO_PCIMR register */
#define PIO_PCIMR_Msk                         _UINT32_(0x0000000F)                                 /* (PIO_PCIMR) Register Mask  */


/* -------- PIO_PCISR : (PIO Offset: 0x160) ( R/ 32) Parallel Capture Interrupt Status Register -------- */
#define PIO_PCISR_DRDY_Pos                    _UINT32_(0)                                          /* (PIO_PCISR) Parallel Capture Mode Data Ready Position */
#define PIO_PCISR_DRDY_Msk                    (_UINT32_(0x1) << PIO_PCISR_DRDY_Pos)                /* (PIO_PCISR) Parallel Capture Mode Data Ready Mask */
#define PIO_PCISR_DRDY(value)                 (PIO_PCISR_DRDY_Msk & (_UINT32_(value) << PIO_PCISR_DRDY_Pos)) /* Assigment of value for DRDY in the PIO_PCISR register */
#define PIO_PCISR_OVRE_Pos                    _UINT32_(1)                                          /* (PIO_PCISR) Parallel Capture Mode Overrun Error Position */
#define PIO_PCISR_OVRE_Msk                    (_UINT32_(0x1) << PIO_PCISR_OVRE_Pos)                /* (PIO_PCISR) Parallel Capture Mode Overrun Error Mask */
#define PIO_PCISR_OVRE(value)                 (PIO_PCISR_OVRE_Msk & (_UINT32_(value) << PIO_PCISR_OVRE_Pos)) /* Assigment of value for OVRE in the PIO_PCISR register */
#define PIO_PCISR_Msk                         _UINT32_(0x00000003)                                 /* (PIO_PCISR) Register Mask  */


/* -------- PIO_PCRHR : (PIO Offset: 0x164) ( R/ 32) Parallel Capture Reception Holding Register -------- */
#define PIO_PCRHR_RDATA_Pos                   _UINT32_(0)                                          /* (PIO_PCRHR) Parallel Capture Mode Reception Data Position */
#define PIO_PCRHR_RDATA_Msk                   (_UINT32_(0xFFFFFFFF) << PIO_PCRHR_RDATA_Pos)        /* (PIO_PCRHR) Parallel Capture Mode Reception Data Mask */
#define PIO_PCRHR_RDATA(value)                (PIO_PCRHR_RDATA_Msk & (_UINT32_(value) << PIO_PCRHR_RDATA_Pos)) /* Assigment of value for RDATA in the PIO_PCRHR register */
#define PIO_PCRHR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PIO_PCRHR) Register Mask  */


/** \brief PIO register offsets definitions */
#define PIO_PER_REG_OFST               _UINT32_(0x00)      /* (PIO_PER) PIO Enable Register Offset */
#define PIO_PDR_REG_OFST               _UINT32_(0x04)      /* (PIO_PDR) PIO Disable Register Offset */
#define PIO_PSR_REG_OFST               _UINT32_(0x08)      /* (PIO_PSR) PIO Status Register Offset */
#define PIO_OER_REG_OFST               _UINT32_(0x10)      /* (PIO_OER) Output Enable Register Offset */
#define PIO_ODR_REG_OFST               _UINT32_(0x14)      /* (PIO_ODR) Output Disable Register Offset */
#define PIO_OSR_REG_OFST               _UINT32_(0x18)      /* (PIO_OSR) Output Status Register Offset */
#define PIO_IFER_REG_OFST              _UINT32_(0x20)      /* (PIO_IFER) Glitch Input Filter Enable Register Offset */
#define PIO_IFDR_REG_OFST              _UINT32_(0x24)      /* (PIO_IFDR) Glitch Input Filter Disable Register Offset */
#define PIO_IFSR_REG_OFST              _UINT32_(0x28)      /* (PIO_IFSR) Glitch Input Filter Status Register Offset */
#define PIO_SODR_REG_OFST              _UINT32_(0x30)      /* (PIO_SODR) Set Output Data Register Offset */
#define PIO_CODR_REG_OFST              _UINT32_(0x34)      /* (PIO_CODR) Clear Output Data Register Offset */
#define PIO_ODSR_REG_OFST              _UINT32_(0x38)      /* (PIO_ODSR) Output Data Status Register Offset */
#define PIO_PDSR_REG_OFST              _UINT32_(0x3C)      /* (PIO_PDSR) Pin Data Status Register Offset */
#define PIO_IER_REG_OFST               _UINT32_(0x40)      /* (PIO_IER) Interrupt Enable Register Offset */
#define PIO_IDR_REG_OFST               _UINT32_(0x44)      /* (PIO_IDR) Interrupt Disable Register Offset */
#define PIO_IMR_REG_OFST               _UINT32_(0x48)      /* (PIO_IMR) Interrupt Mask Register Offset */
#define PIO_ISR_REG_OFST               _UINT32_(0x4C)      /* (PIO_ISR) Interrupt Status Register Offset */
#define PIO_MDER_REG_OFST              _UINT32_(0x50)      /* (PIO_MDER) Multi-driver Enable Register Offset */
#define PIO_MDDR_REG_OFST              _UINT32_(0x54)      /* (PIO_MDDR) Multi-driver Disable Register Offset */
#define PIO_MDSR_REG_OFST              _UINT32_(0x58)      /* (PIO_MDSR) Multi-driver Status Register Offset */
#define PIO_PUDR_REG_OFST              _UINT32_(0x60)      /* (PIO_PUDR) Pull-up Disable Register Offset */
#define PIO_PUER_REG_OFST              _UINT32_(0x64)      /* (PIO_PUER) Pull-up Enable Register Offset */
#define PIO_PUSR_REG_OFST              _UINT32_(0x68)      /* (PIO_PUSR) Pad Pull-up Status Register Offset */
#define PIO_ABCDSR_REG_OFST            _UINT32_(0x70)      /* (PIO_ABCDSR) Peripheral ABCD Select Register 0 Offset */
#define PIO_ABCDSR0_REG_OFST           _UINT32_(0x70)      /* (PIO_ABCDSR0) Peripheral ABCD Select Register 0 Offset */
#define PIO_ABCDSR1_REG_OFST           _UINT32_(0x74)      /* (PIO_ABCDSR1) Peripheral ABCD Select Register 0 Offset */
#define PIO_IFSCDR_REG_OFST            _UINT32_(0x80)      /* (PIO_IFSCDR) Input Filter Slow Clock Disable Register Offset */
#define PIO_IFSCER_REG_OFST            _UINT32_(0x84)      /* (PIO_IFSCER) Input Filter Slow Clock Enable Register Offset */
#define PIO_IFSCSR_REG_OFST            _UINT32_(0x88)      /* (PIO_IFSCSR) Input Filter Slow Clock Status Register Offset */
#define PIO_SCDR_REG_OFST              _UINT32_(0x8C)      /* (PIO_SCDR) Slow Clock Divider Debouncing Register Offset */
#define PIO_PPDDR_REG_OFST             _UINT32_(0x90)      /* (PIO_PPDDR) Pad Pull-down Disable Register Offset */
#define PIO_PPDER_REG_OFST             _UINT32_(0x94)      /* (PIO_PPDER) Pad Pull-down Enable Register Offset */
#define PIO_PPDSR_REG_OFST             _UINT32_(0x98)      /* (PIO_PPDSR) Pad Pull-down Status Register Offset */
#define PIO_OWER_REG_OFST              _UINT32_(0xA0)      /* (PIO_OWER) Output Write Enable Offset */
#define PIO_OWDR_REG_OFST              _UINT32_(0xA4)      /* (PIO_OWDR) Output Write Disable Offset */
#define PIO_OWSR_REG_OFST              _UINT32_(0xA8)      /* (PIO_OWSR) Output Write Status Register Offset */
#define PIO_AIMER_REG_OFST             _UINT32_(0xB0)      /* (PIO_AIMER) Additional Interrupt Modes Enable Register Offset */
#define PIO_AIMDR_REG_OFST             _UINT32_(0xB4)      /* (PIO_AIMDR) Additional Interrupt Modes Disable Register Offset */
#define PIO_AIMMR_REG_OFST             _UINT32_(0xB8)      /* (PIO_AIMMR) Additional Interrupt Modes Mask Register Offset */
#define PIO_ESR_REG_OFST               _UINT32_(0xC0)      /* (PIO_ESR) Edge Select Register Offset */
#define PIO_LSR_REG_OFST               _UINT32_(0xC4)      /* (PIO_LSR) Level Select Register Offset */
#define PIO_ELSR_REG_OFST              _UINT32_(0xC8)      /* (PIO_ELSR) Edge/Level Status Register Offset */
#define PIO_FELLSR_REG_OFST            _UINT32_(0xD0)      /* (PIO_FELLSR) Falling Edge/Low-Level Select Register Offset */
#define PIO_REHLSR_REG_OFST            _UINT32_(0xD4)      /* (PIO_REHLSR) Rising Edge/High-Level Select Register Offset */
#define PIO_FRLHSR_REG_OFST            _UINT32_(0xD8)      /* (PIO_FRLHSR) Fall/Rise - Low/High Status Register Offset */
#define PIO_LOCKSR_REG_OFST            _UINT32_(0xE0)      /* (PIO_LOCKSR) Lock Status Offset */
#define PIO_WPMR_REG_OFST              _UINT32_(0xE4)      /* (PIO_WPMR) Write Protection Mode Register Offset */
#define PIO_WPSR_REG_OFST              _UINT32_(0xE8)      /* (PIO_WPSR) Write Protection Status Register Offset */
#define PIO_SCHMITT_REG_OFST           _UINT32_(0x100)     /* (PIO_SCHMITT) Schmitt Trigger Register Offset */
#define PIO_DRIVER_REG_OFST            _UINT32_(0x118)     /* (PIO_DRIVER) I/O Drive Register Offset */
#define PIO_PCMR_REG_OFST              _UINT32_(0x150)     /* (PIO_PCMR) Parallel Capture Mode Register Offset */
#define PIO_PCIER_REG_OFST             _UINT32_(0x154)     /* (PIO_PCIER) Parallel Capture Interrupt Enable Register Offset */
#define PIO_PCIDR_REG_OFST             _UINT32_(0x158)     /* (PIO_PCIDR) Parallel Capture Interrupt Disable Register Offset */
#define PIO_PCIMR_REG_OFST             _UINT32_(0x15C)     /* (PIO_PCIMR) Parallel Capture Interrupt Mask Register Offset */
#define PIO_PCISR_REG_OFST             _UINT32_(0x160)     /* (PIO_PCISR) Parallel Capture Interrupt Status Register Offset */
#define PIO_PCRHR_REG_OFST             _UINT32_(0x164)     /* (PIO_PCRHR) Parallel Capture Reception Holding Register Offset */

